using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAP_3
{
    internal class Task1
    {
        // 1 - Класс работы с выводом на экран, результат отправляется в очередь обработки.
        // 2 - Класс работы с вводом пользователя, результат отправляется в очередь обработки.
        // 3 - Класс заполнения или инициализации матрицы (методы начало игры илиже инициализация, изменение)
        // 4 - Класс анализа матрицы ( подсчет баллов,есть ли бомбы, меняющие матрицу(если есть - вызов метода класса заполнения через очередь событий) проверка на конец игры)
        // 5 - Класс EventPipeline, реализующий сущность движка, на вход подается сценарии и условия, работает бесконечно, пока пользователь не захочет выйти.
    }
}
